app/controllers/accounts_controller.rb

INSERT INTO "accounts" ("cust_id", "name", "amount", "pin", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["cust_id", "priya@12"], ["name", "priya"], ["amount", 1500], ["pin", "1234"], ["created_at", "2023-08-03 10:02:35.478562"], ["updated_at", "2023-08-03 10:02:35.478562"]]
---
    def create
        account = Account.new(account_params)
        if account.save

SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show
        account = Account.find_by(id: params[:id])

SELECT "accounts".* FROM "accounts" WHERE "accounts"."cust_id" = $1 LIMIT $2  [["cust_id", "geeta@12"], ["LIMIT", 1]]
SELECT 1 AS one FROM "accounts" WHERE "accounts"."cust_id" = $1 AND "accounts"."id" != $2 LIMIT $3  [["cust_id", "geeta@12"], ["id", 1], ["LIMIT", 1]]
---
    def account_details
        account = Account.find_by(cust_id: params[:cust_id])
        if account.present? && params[:input] == "n"
            render json: {message: " welcome to our banking app #{account.name}",data: account.name}
        elsif account.present? && params[:input] == "na"

SELECT "accounts".* FROM "accounts" WHERE "accounts"."cust_id" = $1 LIMIT $2  [["cust_id", "geeta@12"], ["LIMIT", 1]]
SELECT 1 AS one FROM "accounts" WHERE "accounts"."cust_id" = $1 AND "accounts"."id" != $2 LIMIT $3  [["cust_id", "geeta@12"], ["id", 1], ["LIMIT", 1]]
---
    def check_balance
        account = Account.find_by(cust_id: params[:cust_id])
        p_pin = params[:pin]
        if account.present? && account.pin == p_pin

SELECT "accounts".* FROM "accounts" WHERE "accounts"."cust_id" = $1 LIMIT $2  [["cust_id", "geeta@12"], ["LIMIT", 1]]
SELECT 1 AS one FROM "accounts" WHERE "accounts"."cust_id" = $1 AND "accounts"."id" != $2 LIMIT $3  [["cust_id", "geeta@12"], ["id", 1], ["LIMIT", 1]]
UPDATE "accounts" SET "amount" = $1, "updated_at" = $2 WHERE "accounts"."id" = $3  [["amount", 1600], ["updated_at", "2023-08-03 10:09:13.450254"], ["id", 2]]
INSERT INTO "transactions" ("cust_id", "transaction_type", "amount", "account_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["cust_id", "geeta@12"], ["transaction_type", "deposit"], ["amount", 100], ["account_id", 1], ["created_at", "2023-08-04 06:13:06.035739"], ["updated_at", "2023-08-04 06:13:06.035739"]]
---
    def deposit
        money = params[:deposit_money]
        p_pin = params[:pin]
        account = Account.find_by(cust_id: params[:cust_id])
        if account.present? && account.pin == p_pin
            n_amount = account.amount + money.to_i
            account.update(amount: n_amount)
            tr = Transaction.create(cust_id: account.cust_id,transaction_type: "deposit",amount: money,account_id: account.id)

SELECT "accounts".* FROM "accounts" WHERE "accounts"."cust_id" = $1 LIMIT $2  [["cust_id", "geeta@12"], ["LIMIT", 1]]
SELECT 1 AS one FROM "accounts" WHERE "accounts"."cust_id" = $1 AND "accounts"."id" != $2 LIMIT $3  [["cust_id", "geeta@12"], ["id", 1], ["LIMIT", 1]]
UPDATE "accounts" SET "amount" = $1, "updated_at" = $2 WHERE "accounts"."id" = $3  [["amount", 10900], ["updated_at", "2023-08-03 09:39:04.049733"], ["id", 1]]
---
    def withdraw
        money = params[:withdraw_money]
        p_pin = params[:pin]
        account = Account.find_by(cust_id: params[:cust_id])
        if account.present? && account.pin == p_pin
            n_amount = account.amount - money.to_i
            account.update(amount: n_amount)

SELECT "accounts".* FROM "accounts" WHERE "accounts"."cust_id" = $1 LIMIT $2  [["cust_id", "geeta@12"], ["LIMIT", 1]]
SELECT 1 AS one FROM "accounts" WHERE "accounts"."cust_id" = $1 AND "accounts"."id" != $2 LIMIT $3  [["cust_id", "priya@12"], ["id", 2], ["LIMIT", 1]]
UPDATE "accounts" SET "amount" = $1, "updated_at" = $2 WHERE "accounts"."id" = $3  [["amount", 11200], ["updated_at", "2023-08-04 06:22:23.354675"], ["id", 1]]
INSERT INTO "transactions" ("cust_id", "transaction_type", "amount", "account_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["cust_id", "geeta@12"], ["transaction_type", "received"], ["amount", 100], ["account_id", 1], ["created_at", "2023-08-04 06:22:23.396651"], ["updated_at", "2023-08-04 06:22:23.396651"]]
---
    def transfer
        money = params[:transfer_money]
        p_pin = params[:pin]
        sender = Account.find_by(cust_id: params[:sender_id])
        receiver = Account.find_by(cust_id: params[:receiver_id])
        byebug
        if sender.present? && receiver.present? && sender.pin == p_pin
            s_amount = sender.amount - money.to_i
            r_amount = receiver.amount + money.to_i
            sender.update(amount: s_amount)
            receiver.update(amount: r_amount)
            s_tr = Transaction.create(cust_id: sender.cust_id,transaction_type: "transfer",amount: money,account_id: sender.id)

SELECT "accounts".* FROM "accounts" WHERE "accounts"."cust_id" = $1 AND "accounts"."pin" = $2 LIMIT $3  [["cust_id", "geeta@12"], ["pin", "1234"], ["LIMIT", 1]]
SELECT "transactions".* FROM "transactions" WHERE "transactions"."cust_id" = $1  [["cust_id", "geeta@12"]]
---
    def transaction_history
        account = Account.find_by(cust_id: params[:cust_id],pin: params[:pin])
        if account.present?
            tr = Transaction.where(cust_id: params[:cust_id])